In [1]:
import pandas as pd
from sqlalchemy import create_engine
from pathlib import Path
from tqdm import tqdm
from rq import Queue
from redis import Redis
from time import sleep
from random import randint
import os
import dask.dataframe as dd
from src.helpers import get_dataframe

In [2]:
con_str = "postgresql://postgres:postgres@postgres"
data_location = Path("data/rq_results")
data_location.mkdir(exist_ok=True)
engine = create_engine(con_str)

In [3]:
pd.read_sql("SELECT COUNT(*) FROM yellow_taxi", engine)

     count
0  7696617

In [4]:
# Initalize redis
redis_client = Redis(host="redis")
Q = Queue(connection=redis_client)

In [5]:
jobs = []
for i in range(1,32):
    day = f"2019-01-{i:02}"
    job = Q.enqueue(get_dataframe, day, con_str, data_location)
    jobs.append(job)

In [6]:
while any([not(j.is_finished) for j in jobs]):
    print(f"Some jobs still running - {sum(not(j.is_finished) for j in jobs)} jobs are still running")
    sleep(15)

Some jobs still running - 31 jobs are still running
Some jobs still running - 31 jobs are still running
Some jobs still running - 25 jobs are still running
Some jobs still running - 22 jobs are still running
Some jobs still running - 18 jobs are still running
Some jobs still running - 14 jobs are still running
Some jobs still running - 11 jobs are still running
Some jobs still running - 7 jobs are still running
Some jobs still running - 3 jobs are still running

In [7]:
ddf = dd.read_parquet("data/rq_results/*.parquet")

In [8]:
ddf.info()

<class 'dask.dataframe.core.DataFrame'>
Columns: 4 entries, tpep_pickup_datetime to fare_amount
dtypes: datetime64[ns](1), float64(3)

In [9]:
ddf.head()

  tpep_pickup_datetime  passenger_count  trip_distance  fare_amount
0  2019-01-01 05:41:56              NaN          13.60        48.49
1  2019-01-01 05:33:00              NaN          18.12        64.55
2  2019-01-01 05:18:08              NaN           5.03        29.45
3  2019-01-01 00:38:45              NaN           2.21        12.24
4  2019-01-01 05:32:00              NaN          13.11        47.99

In [10]:
ddf.describe().compute()

       passenger_count  trip_distance   fare_amount
count     7.667408e+06   7.696080e+06  7.696080e+06
mean      1.567009e+00   2.830114e+00  1.252952e+01
std       1.224395e+00   3.774527e+00  2.615988e+02
min       0.000000e+00   0.000000e+00 -3.620000e+02
25%       1.000000e+00   1.070000e+00  6.500000e+00
50%       1.000000e+00   1.900000e+00  9.500000e+00
75%       2.000000e+00   3.910000e+00  1.550000e+01
max       9.000000e+00   8.318000e+02  6.232599e+05

In [11]:
ddf.head()

  tpep_pickup_datetime  passenger_count  trip_distance  fare_amount
0  2019-01-01 05:41:56              NaN          13.60        48.49
1  2019-01-01 05:33:00              NaN          18.12        64.55
2  2019-01-01 05:18:08              NaN           5.03        29.45
3  2019-01-01 00:38:45              NaN           2.21        12.24
4  2019-01-01 05:32:00              NaN          13.11        47.99